/*
 * Copyright 2009-2011 Cedric Priscal
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include	"xmlog.h"
#include	"xm_type.h"
#include	"message.h"
#include	"hisense.h"
#include	"air-condition_msg.h"
#include	"cmdanalysis.h"

#define XM_KT_SET_LEN 30
#define XM_KT_STATUS_LEN 62
#define XM_KT_SUPPORT_LEN 17

XM_Command xm_KTGN={//功能查询
	0,
	53,
	0,
	17,
	0,
	0,
	0,
	102,
	64,
	0,
	0,
	{
		
	},
	{
		{7,8,0,NULL,0,1,0,0},//室内风量支持档位数KTFL
		{15,8,0,NULL,0,1,0,0},//睡眠模式支持数量KTSM
		{16,1,0,NULL,0,1,0,0},//表示单冷/冷暖机型KTDR
		{17,1,0,NULL,0,1,0,0},//开关机控制位KTKJ
		{18,1,0,NULL,0,1,0,0},//室内单个风向控制功能KTFX
		{19,1,0,NULL,0,1,0,0},//室内温度设置KTWD
		{20,1,0,NULL,0,1,0,0},//室内湿度设置KTSD
		{21,1,0,NULL,0,1,0,0},//室内体感温度接收允许KTTGCZ
		{22,1,0,NULL,0,1,0,0},//室内温度体感补偿控制KTTGBC
		{23,1,0,NULL,0,1,0,0},//自动和除湿温度补偿KTWDBC
		{31,8,0,NULL,0,1,0,0},//体感温度补偿值（绝对值）		
		{39,8,0,NULL,0,1,0,0},//自动和除湿温度补偿值（绝对值）
		{40,1,0,NULL,0,1,0,0},//华氏/摄氏温度显示转换KTHS
		{41,1,0,NULL,0,1,0,0},//普通定时开关机KTGTT
		{42,1,0,NULL,0,1,0,0},//实时定时开关机KTGT KTKT
		{43,1,0,NULL,0,1,0,0},//6位置可定室内风门位置控制KTVFM
		{44,1,0,NULL,0,1,0,0},//上下风门控制KTVFC
		{45,1,0,NULL,0,1,0,0},//左右风门控制KTHFC
		{46,1,0,NULL,0,1,0,0},//自然风控制KTZRF
		{47,1,0,NULL,0,1,0,0},//电热开停控制KTDR
		{55,8,0,NULL,0,1,0,0},//除湿模式数量KTCS
		{56,1,0,NULL,0,1,0,0},//节能控制KTJN
		{57,1,0,NULL,0,1,0,0},//并用节电控制KTBY
		{58,1,0,NULL,0,1,0,0},//高效（强力）控制KTGX
		{59,1,0,NULL,0,1,0,0},//双模切换控制KTDM
		{60,1,0,NULL,0,1,0,0},//清新控制KTJH
		{61,1,0,NULL,0,1,0,0},//换风控制KTHF
		{62,1,0,NULL,0,1,0,0},//室内清洁控制KTQJ
		{63,1,0,NULL,0,1,0,0},//室外清洁控制KTSWQJ
		{64,1,0,NULL,0,1,0,0},//智慧眼控制KTZN
		{65,1,0,NULL,0,1,0,0},//静音模式控制KTJY
		{66,1,0,NULL,0,1,0,0},//语音控制KTYY
		{67,1,0,NULL,0,1,0,0},//除烟控制KTCY
		{68,1,0,NULL,0,1,0,0},//背景灯控制KTBJD
		{69,1,0,NULL,0,1,0,0},//显示屏发光显示控制KTXSP
		{70,1,0,NULL,0,1,0,0},//LED指示灯控制KTLED
		{71,1,0,NULL,0,1,0,0},//室内外温度切换显示控制KTSRW
		{72,1,0,NULL,0,1,0,0},//室内过滤网清洁复位控制KTGLW
		{73,1,0,NULL,0,1,0,0},//左风摆开停控制KTZFC
		{74,1,0,NULL,0,1,0,0},//右风摆开停控制KTYFC
		{75,1,0,NULL,0,1,0,0},//101#-0#第22字节BIT1、BIT0预留位的控制功能
		{76,1,0,NULL,0,1,0,0},//101#-0#第11字节BIT1、BIT0预留位的控制功能
		{77,1,0,NULL,0,1,0,0},//101#-0#第10字节BIT2~BIT0预留位的控制功能
		{78,1,0,NULL,0,1,0,0},//海信/科龙控制规则
		{87,8,0,NULL,0,1,0,0},//101#-0#第23字节预留位的控制功能
		{95,8,0,NULL,0,1,0,0},//101#-0#第25字节预留位的控制功能
		{103,8,0,NULL,0,1,0,0},//101#-0#第26字节预留位的控制功能
		{111,8,0,NULL,0,1,0,0},//101#-0#第27字节预留位的控制功能
		{119,8,0,NULL,0,1,0,0},//101#-0#第28字节预留位的控制功能
		{127,8,0,NULL,0,1,0,0},//101#-0#第29字节预留位的控制功能
		{135,8,0,NULL,0,1,0,0},//101#-0#第30字节预留位的控制功能

		/*ver 02.15*/
		{79,1,0,NULL,0,1,0,0},// VOC 检测
		{80,1,0,NULL,0,1,0,0},//Power Saver
	}
};


XM_Command xm_KTXYM={//设备信息码命令
	4,
	4,
	26,
	26,
	0,
	103,
	1,
	103,
	0,
	0,
	0,
	{
		{7,8,0,NULL,0,0,1,0},//第一个字节代表数据类型0表示使用BCD编码，
		{191,184,0,NULL,0,0,1,0},//后续23个字节表示数据，
		{199,8,0,NULL,0,0,1,0},//后2字节为累加和
		{207,8,0,NULL,0,0,1,0},//后2字节为累加和
	},
	{
		{7,8,0,NULL,0,1,0,0},//第一个字节代表数据类型0表示使用BCD编码，
		{191,184,0,NULL,0,1,0,0},//后续23个字节表示数据，
		{199,8,0,NULL,0,1,0,0},//后2字节为累加和
		{207,8,0,NULL,0,1,0,0},//后2字节为累加和
	}
};


XM_Command xm_KTDQEFD={//读取家电（第1）控制器的EEPROM全体数据命令
	2,
	1,
	2,
	255,
	0,
	0,
	0,
	201,
	1,
	0,
	0,
	{
		{7,8,0,NULL,0,0,1,0},
		{15,8,0,NULL,0,0,1,0}
	},
	{
		{2047,2048,0,NULL,0,1,0,0}
	}
};


XM_Command xm_KTDQSEFD={//读取家电（第1）控制器全体程序数据命令
	2,
	1,
	2,
	255,
	0,
	0,
	0,
	201,
	11,
	0,
	0,
	{
		{7,8,0,NULL,0,0,1,0},
		{15,8,0,NULL,0,0,1,0}
	},
	{
		{2047,2048,0,NULL,0,1,0,0}
	}
};


XM_Command xm_KTDQZEFD={//读取所需设备指定控制器的全体密钥数据命令
	2,
	1,
	2,
	255,
	0,
	0,
	0,
	201,
	22,
	0,
	0,
	{
		{7,8,0,NULL,0,0,1,0},
		{15,8,0,NULL,0,0,1,0}
	},
	{
		{2047,2048,0,NULL,0,1,0,0}
	}
};


XM_Value xm_FL2value[]={
		{"auto",0},
		{"mute",1},
		{"weak",2},
		{"middle",3},
		{"strong",4},
};
XM_Value xm_FLR2value[]={
		{"off",0},
		{"auto",1},
		{"mute",2},
		{"mute",3},
		{"weak",4},
		{"auto",5},
		{"middle",6},
		{"auto",7},
		{"strong",8},
		{"auto",9}
};

XM_Value xm_SM2value[]={
		{"off",0},
		{"general",1},
		{"aged",2},
		{"younger",3},
		{"child",4}
		
};

XM_Value xm_VFM2value[]={		
		{"sweep",0},
		{"auto",1},
		{"#1",2},
		{"#2",3},
		{"#3",4},
		{"#4",5},
		{"#5",6},
		{"#6",7},
};
XM_Command xm_KTFL={//风量
	10,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{6,7,sizeof(xm_FL2value)/sizeof(xm_FL2value[0]),xm_FL2value,0,0,1,0},	//风量	
		{7,1,0,NULL,0,0,1,1},
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//睡眠
		{15,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//高效
		{141,1,0,NULL,0,0,1,1},
		{154,1,0,NULL,0,0,1,0},//静音
		{155,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{7,8,sizeof(xm_FLR2value)/sizeof(xm_FLR2value[0]),xm_FLR2value,0,1,0,0},
		{7,8,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTSM={//睡眠
	10,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//睡眠
		{15,1,0,NULL,0,0,1,1},
		{6,7,sizeof(xm_FL2value)/sizeof(xm_FL2value[0]),xm_FL2value,0,0,1,0},//风量
		{7,1,0,NULL,0,0,1,1},		
		{154,1,0,NULL,0,0,1,0},//静音
		{155,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//高效
		{141,1,0,NULL,0,0,1,1},		
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,1,0,0},
		{15,8,0,NULL,1,0,0,0}
	}
};

XM_Value xm_CS2value[]={
		{"auto",0},
		{"1#",1},
		{"2#",2},
		{"3#",3},
		{"4#",4},
		{"5#",5},
		{"6#",6},
		{"7#",7}
};

XM_Command xm_KTCS={//除湿模式
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{122,3,sizeof(xm_CS2value)/sizeof(xm_CS2value[0]),xm_CS2value,0,0,1,0},
		{123,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{146,3,sizeof(xm_CS2value)/sizeof(xm_CS2value[0]),xm_CS2value,0,1,0,0},
		{55,8,0,NULL,1,0,0,0}
	}
};

XM_Value xm_mode2value[]={
		{"blow",0},
		{"heat",1},
		{"cool",2},
		{"dehumidify",3},
		{"auto",4},
		{"auto",5},
		{"auto",6},
		{"auto",7},
		{"auto",8}
};

XM_Command xm_KTYX={//模式
	18,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{18,3,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,0,1,0},//模式
		{19,1,0,NULL,0,0,1,1},
		{6,7,sizeof(xm_FL2value)/sizeof(xm_FL2value[0]),xm_FL2value,0,0,1,0},//当前风量		
		{7,1,0,NULL,0,0,1,1},		
		{30,7,0,NULL,0,0,1,0},//温度
		{31,1,0,NULL,0,0,1,1},
		{154,1,0,NULL,0,0,1,0},//取消静音
		{155,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//取消高效
		{141,1,0,NULL,0,0,1,1},
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//取消睡眠
		{15,1,0,NULL,0,0,1,1},		
		{134,1,0,NULL,0,0,1,0},//取消电热
		{135,1,0,NULL,0,0,1,1},
		{122,3,sizeof(xm_CS2value)/sizeof(xm_CS2value[0]),xm_CS2value,0,0,1,0},//除湿模式
		{123,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{19,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},
		{16,8,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTKJ={//开机
	22,
	1,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{20,1,0,NULL,0,0,1,0},//开机
		{21,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{64,1,0,NULL,0,0,1,0},//取消普通定时关机
		{71,1,0,NULL,0,0,1,1},
		{110,1,0,NULL,0,0,1,0},//取消定时关机
		{111,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//取消高效
		{141,1,0,NULL,0,0,1,1},
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//取消睡眠
		{15,1,0,NULL,0,0,1,1},		
		{134,1,0,NULL,0,0,1,0},//取消电热
		{135,1,0,NULL,0,0,1,1},
		{136,1,0,NULL,0,0,1,0},//取消节能
		{137,1,0,NULL,0,0,1,1},
		{138,1,0,NULL,0,0,1,0},//取消并用节电
		{139,1,0,NULL,0,0,1,1},
		{158,1,0,NULL,0,0,1,0},//除烟(净化)
		{159,1,0,NULL,0,0,1,1},
		{142,1,0,NULL,0,0,1,0},//取消双模
		{143,1,0,NULL,0,0,1,1},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{20,1,0,NULL,0,1,0,0}
	}
};

XM_Command xm_KTFX={//风向
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{22,1,0,NULL,0,0,1,0},
		{23,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{22,1,0,NULL,0,1,0,0},
		{18,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTWD={//温度
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{30,7,0,NULL,0,0,1,0},
		{31,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{31,8,0,NULL,0,1,0,0},
		{19,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTSD={//湿度
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{38,7,0,NULL,0,0,1,0},
		{39,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{55,8,0,NULL,0,1,0,0},
		{20,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTTGWD={//体感室内温度
	3,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{47,8,0,NULL,0,0,1,0},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{71,8,0,NULL,0,1,0,0},
		{21,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTTGBC={//体感室内温度补偿
	6,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{52,5,0,NULL,0,0,1,0},
		{53,1,0,NULL,0,0,1,1},
		{54,1,0,NULL,0,0,1,1},
		{55,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{76,5,0,NULL,0,1,0,0},
		{31,8,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTTGCZ={//体感控制
	7,
	4,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{		
		{54,1,0,NULL,0,0,1,0},
		{47,8,0,NULL,0,0,1,0},//体感 温度
		{52,5,0,NULL,0,0,1,0},//体感温度补偿
		{53,1,0,NULL,0,0,1,1},
		{55,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{71,8,0,NULL,0,1,0,0},
		{76,5,0,NULL,0,1,0,0},
		{78,1,0,NULL,0,1,0,0},
		{22,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTWDBC={//自动工作模式和除湿模式的温度补偿
	6,
	3,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{18,3,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,0,1,0},//模式:除湿（与第16字节除湿模式联动）；
		{19,1,0,NULL,0,0,1,1},
		{59,4,0,NULL,0,0,1,0},
		{60,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{83,4,0,NULL,0,1,0,0},
		{23,1,0,NULL,1,0,0,0},
		{39,8,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTHS={//华氏/摄氏温度显示设置
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{62,1,0,NULL,0,0,1,0},
		{63,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{86,1,0,NULL,0,1,0,0},
		{40,1,0,NULL,1,0,0,0}
	}
};


XM_Value xm_GTT2value[]={
		{"off",0},
		{"0.5h",1},
		{"1.0h",2},
		{"1.5h",3},
		{"2.0h",4},
		{"2.5h",5},
		{"3.0h",6},
		{"3.5h",7},
		{"4.0h",8},
		{"4.5h",9},
		{"5.0h",10},
		{"5.5h",11},
		{"6.0h",12},
		{"6.5h",13},
		{"7.0h",14},
		{"7.5h",15},
		{"8.0h",16},
		{"8.5h",17},
		{"9.0h",18},
		{"9.5h",19},
		{"10h",20},
		{"11h",21},
		{"12h",22},
		{"13h",23},
		{"14h",24},
		{"15h",25},
		{"16h",26},
		{"17h",27},
		{"18h",28},
		{"10h",29},
		{"20h",30},
		{"21h",31},
		{"22h",32},
		{"23h",33}
};

XM_Command xm_KTGTT={//普通定时开关机
	5,
	3,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{70,6,sizeof(xm_GTT2value)/sizeof(xm_GTT2value[0]),xm_GTT2value,0,0,1,0},		
		{64,1,0,NULL,0,0,1,0},
		{71,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{94,6,sizeof(xm_GTT2value)/sizeof(xm_GTT2value[0]),xm_GTT2value,0,1,0,0},
		{88,1,0,NULL,0,1,0,0},
		{41,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTSSH={//实时时钟的小时值
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{76,5,0,NULL,0,0,1,0},
		//add by mujian;根据空调0528文档，设置时间需要增加设置位；
		{79,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{100,5,0,NULL,0,1,0,0},
		{42,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTSSM={//实时时钟的分钟值
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{85,6,0,NULL,0,0,1,0},
		//add by mujian;根据空调0528文档，设置时间需要增加设置位；
		{87,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{109,6,0,NULL,0,1,0,0},
		{42,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTSS={
	6,
	3,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{76,5,0,NULL,0,0,1,0},//实时时钟的小时值
		{79,1,0,NULL,0,0,1,1},		
		{85,6,0,NULL,0,0,1,0},//实时时钟的分钟值
		{87,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{100,5,0,NULL,0,1,0,0},
		{109,6,0,NULL,0,1,0,0},
		{42,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTKT={//实时开机控制
	12,
	4,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{94,1,0,NULL,0,0,1,0},
		{95,1,0,NULL,0,0,1,1},
		{92,5,0,NULL,0,0,1,0},//xm_KTKTH 小时
		{93,1,0,NULL,0,0,1,1},
		{101,6,0,NULL,0,0,1,0},//xm_KTKTM 分钟
		{103,1,0,NULL,0,0,1,1},
		{76,5,0,NULL,0,0,1,0},//xm_KTSSH 实时时钟的小时值
		{79,1,0,NULL,0,0,1,1},
		{85,6,0,NULL,0,0,1,0},//xm_KTSSM实时时钟的分钟值
		{87,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
		
	},
	{
		{118,1,0,NULL,0,1,0,0},
		{42,1,0,NULL,1,0,0,0},
		{116,5,0,NULL,0,1,0,0},//xm_KTKTH小时
		{125,6,0,NULL,0,1,0,0},//xm_KTKTM分钟
	}
};

XM_Command xm_KTGT={//实时关机控制
	12,
	4,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{110,1,0,NULL,0,0,1,0},
		{111,1,0,NULL,0,0,1,1},
		{108,5,0,NULL,0,0,1,0},//xm_KTGTH 小时
		{109,1,0,NULL,0,0,1,1},
		{117,6,0,NULL,0,0,1,0},//xm_KTGTH 分钟
		{119,1,0,NULL,0,0,1,1},
		{76,5,0,NULL,0,0,1,0},//xm_KTSSH 实时时钟的小时值
		{79,1,0,NULL,0,0,1,1},
		{85,6,0,NULL,0,0,1,0},//xm_KTSSM实时时钟的分钟值
		{87,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{134,1,0,NULL,0,1,0,0},
		{42,1,0,NULL,1,0,0,0},
		{132,5,0,NULL,0,1,0,0},// 小时
		{141,6,0,NULL,0,1,0,0},//分钟
	}
};

XM_Command xm_KTVFM={//上下风门
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{126,3,sizeof(xm_VFM2value)/sizeof(xm_VFM2value[0]),xm_VFM2value,0,0,1,0},
		{127,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{150,3,sizeof(xm_VFM2value)/sizeof(xm_VFM2value[0]),xm_VFM2value,0,1,0,0},
		{43,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTVFC={//上下风开停控制
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{128,1,0,NULL,0,0,1,0},
		{129,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{152,1,0,NULL,0,1,0,0},
		{44,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTVF={//上下风开停
	6,
	4,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{126,3,sizeof(xm_VFM2value)/sizeof(xm_VFM2value[0]),xm_VFM2value,0,0,1,0},//上下风模式
		{127,1,0,NULL,0,0,1,1},
		{128,1,0,NULL,0,0,1,0},//上下风控制
		{129,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{150,3,sizeof(xm_VFM2value)/sizeof(xm_VFM2value[0]),xm_VFM2value,0,1,0,0},
		{43,1,0,NULL,1,0,0,0},
		{152,1,0,NULL,0,1,0,0},
		{44,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTHFC={//左右风开停控制
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{130,1,0,NULL,0,0,1,0},
		{131,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{153,1,0,NULL,0,1,0,0},
		{45,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTHFM={//左右风开停
	8,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{130,1,0,NULL,0,0,1,0},
		{131,1,0,NULL,0,0,1,1},
		{170,1,0,NULL,0,0,1,0},//左风摆
		{171,1,0,NULL,0,0,1,1},
		{172,1,0,NULL,0,0,1,0},//右风摆
		{173,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{153,1,0,NULL,0,1,0,0},
		{45,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTZRF={//自然风开停控制
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{132,1,0,NULL,0,0,1,0},
		{133,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{154,1,0,NULL,0,1,0,0},
		{46,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTDR={//电热
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{134,1,0,NULL,0,0,1,0},
		{135,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{155,1,0,NULL,0,1,0,0},
		{47,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTJN={//节能
	6,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{136,1,0,NULL,0,0,1,0},
		{137,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//高效
		{141,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{156,1,0,NULL,0,1,0,0},
		{48,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTBY={//并用节电
	6,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{138,1,0,NULL,0,0,1,0},
		{139,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//高效
		{141,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{157,1,0,NULL,0,1,0,0},
		{49,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTGXex={//高效
	14,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{140,1,0,NULL,0,0,1,0},
		{141,1,0,NULL,0,0,1,1},		
		{154,1,0,NULL,0,0,1,0},//静音
		{155,1,0,NULL,0,0,1,1},
		{6,7,sizeof(xm_FL2value)/sizeof(xm_FL2value[0]),xm_FL2value,0,0,1,0},	//风量	
		{7,1,0,NULL,0,0,1,1},
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//睡眠
		{15,1,0,NULL,0,0,1,1},
		{136,1,0,NULL,0,0,1,0},
		{137,1,0,NULL,0,0,1,1},
		{138,1,0,NULL,0,0,1,0},
		{139,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{158,1,0,NULL,0,1,0,0},
		{50,1,0,NULL,1,0,0,0}
	}
};



XM_Command xm_KTGX={//高效
	12,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{140,1,0,NULL,0,0,1,0},
		{141,1,0,NULL,0,0,1,1},		
		{154,1,0,NULL,0,0,1,0},//静音
		{155,1,0,NULL,0,0,1,1},
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//睡眠
		{15,1,0,NULL,0,0,1,1},
		{136,1,0,NULL,0,0,1,0},
		{137,1,0,NULL,0,0,1,1},
		{138,1,0,NULL,0,0,1,0},
		{139,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{158,1,0,NULL,0,1,0,0},
		{50,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTDM={//双模
	8,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{142,1,0,NULL,0,0,1,0},//双模
		{143,1,0,NULL,0,0,1,1},
		{136,1,0,NULL,0,0,1,0},//节能
		{137,1,0,NULL,0,0,1,1},
		{138,1,0,NULL,0,0,1,0},//并用节电
		{139,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{159,1,0,NULL,0,1,0,0},
		{51,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTJH={//清新
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{144,1,0,NULL,0,0,1,0},
		{145,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{160,1,0,NULL,0,1,0,0},
		{52,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTHF={//换风
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{146,1,0,NULL,0,0,1,0},
		{147,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{161,1,0,NULL,0,1,0,0},
		{53,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTQJ={//室内清洁
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{148,1,0,NULL,0,0,1,0},
		{149,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{162,1,0,NULL,0,1,0,0},
		{54,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTSWQJ={//室外清洁
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{150,1,0,NULL,0,0,1,0},
		{151,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{163,1,0,NULL,0,1,0,0},
		{55,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTZN={//智慧眼
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{152,1,0,NULL,0,0,1,0},
		{153,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{164,1,0,NULL,0,1,0,0},
		{56,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTJY={//静音
	10,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{154,1,0,NULL,0,0,1,0},
		{155,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},//高效
		{141,1,0,NULL,0,0,1,1},
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,0,1,0},//睡眠
		{15,1,0,NULL,0,0,1,1},
		{6,7,sizeof(xm_FL2value)/sizeof(xm_FL2value[0]),xm_FL2value,0,0,1,0},	//风量	
		{7,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{165,1,0,NULL,0,1,0,0},
		{57,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTYY={//语音
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{156,1,0,NULL,0,0,1,0},
		{157,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{166,1,0,NULL,0,1,0,0},
		{58,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTCY={//除烟
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{158,1,0,NULL,0,0,1,0},
		{159,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{167,1,0,NULL,0,1,0,0},
		{59,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTBJD={//背景灯
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{160,1,0,NULL,0,0,1,0},
		{161,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{168,1,0,NULL,0,1,0,0},
		{60,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTXSP={//显示屏发光
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{162,1,0,NULL,0,0,1,0},
		{163,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{169,1,0,NULL,0,1,0,0},
		{61,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTLED={//LED指示灯
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{164,1,0,NULL,0,0,1,0},
		{165,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{170,1,0,NULL,0,1,0,0},
		{62,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTSRW={//室内外温度切换显示
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{166,1,0,NULL,0,0,1,0},
		{167,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{171,1,0,NULL,0,1,0,0},
		{63,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTGLW={//室内过滤网清洁复位控制
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{168,1,0,NULL,0,0,1,0},
		{169,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{172,1,0,NULL,0,1,0,0},
		{64,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTZFB={//左风摆
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{170,1,0,NULL,0,0,1,0},
		{171,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{173,1,0,NULL,0,1,0,0},
		{65,1,0,NULL,1,0,0,0}
	}
};


XM_Command xm_KTYFB={//右风摆
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{172,1,0,NULL,0,0,1,0},
		{173,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{174,1,0,NULL,0,1,0,0},
		{66,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTLD={//显示屏亮度值
	4,
	2,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{190,7,0,NULL,0,0,1,0},
		{191,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0},
	},
	{
		{494,7,0,NULL,0,1,0,0},
		{61,1,0,NULL,1,0,0,0}
	}
};

XM_Command xm_KTMULTIZD={//多个空调状态；
	0,
	114,
	0,
	82,
	0,
	0,
	0,
	202,
	0,
	0,
	0,
	{		
	},
	{
		{7,8,0,NULL,0,1,0,0},//本桢具有的设备数
		{15,8,0,NULL,0,1,0,0},//每个设备具有的参数字节
		
		{23,8,0,NULL,0,1,0,0},//1#空调设备IP地址的高位
		{31,8,0,NULL,0,1,0,0},//1#空调设备IP地址的低位
		{35,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//1#空调工作模式
		{36,1,0,NULL,0,1,0,0},//1#空调开停机控制
		{39,3,0,NULL,0,1,0,0},//1#空调预留				
		{47,8,0,NULL,0,1,0,0},//1#空调室内温度设定值
		{55,8,0,NULL,0,1,0,0},//1#空调室内实际温度值
		
		{63,8,0,NULL,0,1,0,0},//2#空调设备IP地址的高位
		{71,8,0,NULL,0,1,0,0},//2#空调设备IP地址的低位
		{75,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//2#空调工作模式
		{76,1,0,NULL,0,1,0,0},//2#空调开停机控制
		{79,3,0,NULL,0,1,0,0},//2#空调预留
		{87,8,0,NULL,0,1,0,0},//2#空调室内温度设定值
		{95,8,0,NULL,0,1,0,0},//2#空调室内实际温度值
		
		{103,8,0,NULL,0,1,0,0},//3#空调设备IP地址的高位
		{111,8,0,NULL,0,1,0,0},//3#空调设备IP地址的低位
		{115,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//3#空调工作模式
		{116,1,0,NULL,0,1,0,0},//3#空调开停机控制
		{119,3,0,NULL,0,1,0,0},//3#空调预留
		{127,8,0,NULL,0,1,0,0},//3#空调室内温度设定值
		{135,8,0,NULL,0,1,0,0},//3#空调室内实际温度值
		
		{143,8,0,NULL,0,1,0,0},//4#空调设备IP地址的高位
		{151,8,0,NULL,0,1,0,0},//4#空调设备IP地址的低位
		{155,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//4#空调工作模式
		{156,1,0,NULL,0,1,0,0},//4#空调开停机控制
		{159,3,0,NULL,0,1,0,0},//4#空调预留
		{167,8,0,NULL,0,1,0,0},//4#空调室内温度设定值
		{175,8,0,NULL,0,1,0,0},//4#空调室内实际温度值
		
		{183,8,0,NULL,0,1,0,0},//5#空调设备IP地址的高位
		{191,8,0,NULL,0,1,0,0},//5#空调设备IP地址的低位
		{195,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//5#空调工作模式
		{196,1,0,NULL,0,1,0,0},//5#空调开停机控制
		{199,3,0,NULL,0,1,0,0},//5#空调预留
		{207,8,0,NULL,0,1,0,0},//5#空调室内温度设定值
		{215,8,0,NULL,0,1,0,0},//5#空调室内实际温度值
		
		{223,8,0,NULL,0,1,0,0},//6#空调设备IP地址的高位
		{231,8,0,NULL,0,1,0,0},//6#空调设备IP地址的低位
		{235,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//6#空调工作模式
		{236,1,0,NULL,0,1,0,0},//6#空调开停机控制
		{239,3,0,NULL,0,1,0,0},//6#空调预留
		{247,8,0,NULL,0,1,0,0},//6#空调室内温度设定值
		{255,8,0,NULL,0,1,0,0},//6#空调室内实际温度值
		
		{263,8,0,NULL,0,1,0,0},//7#空调设备IP地址的高位
		{271,8,0,NULL,0,1,0,0},//7#空调设备IP地址的低位
		{275,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//7#空调工作模式
		{276,1,0,NULL,0,1,0,0},//7#空调开停机控制
		{279,3,0,NULL,0,1,0,0},//7#空调预留
		{287,8,0,NULL,0,1,0,0},//7#空调室内温度设定值
		{295,8,0,NULL,0,1,0,0},//7#空调室内实际温度值
		
		{303,8,0,NULL,0,1,0,0},//8#空调设备IP地址的高位
		{311,8,0,NULL,0,1,0,0},//8#空调设备IP地址的低位
		{315,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//8#空调工作模式
		{316,1,0,NULL,0,1,0,0},//8#空调开停机控制
		{319,3,0,NULL,0,1,0,0},//8#空调预留
		{327,8,0,NULL,0,1,0,0},//8#空调室内温度设定值
		{335,8,0,NULL,0,1,0,0},//8#空调室内实际温度值
		
		{343,8,0,NULL,0,1,0,0},//9#空调设备IP地址的高位
		{351,8,0,NULL,0,1,0,0},//9#空调设备IP地址的低位
		{355,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//9#空调工作模式
		{356,1,0,NULL,0,1,0,0},//9#空调开停机控制
		{359,3,0,NULL,0,1,0,0},//9#空调预留
		{367,8,0,NULL,0,1,0,0},//9#空调室内温度设定值
		{375,8,0,NULL,0,1,0,0},//9#空调室内实际温度值
		
		{383,8,0,NULL,0,1,0,0},//10#空调设备IP地址的高位
		{391,8,0,NULL,0,1,0,0},//10#空调设备IP地址的低位
		{395,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//10#空调工作模式
		{396,1,0,NULL,0,1,0,0},//10#空调开停机控制
		{399,3,0,NULL,0,1,0,0},//10#空调预留
		{407,8,0,NULL,0,1,0,0},//10#空调室内温度设定值
		{415,8,0,NULL,0,1,0,0},//10#空调室内实际温度值
		
		{423,8,0,NULL,0,1,0,0},//11#空调设备IP地址的高位
		{431,8,0,NULL,0,1,0,0},//11#空调设备IP地址的低位
		{435,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//11#空调工作模式
		{436,1,0,NULL,0,1,0,0},//11#空调开停机控制
		{439,3,0,NULL,0,1,0,0},//11#空调预留
		{447,8,0,NULL,0,1,0,0},//11#空调室内温度设定值
		{455,8,0,NULL,0,1,0,0},//11#空调室内实际温度值
		
		{463,8,0,NULL,0,1,0,0},//12#空调设备IP地址的高位
		{471,8,0,NULL,0,1,0,0},//12#空调设备IP地址的低位
		{475,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//12#空调工作模式
		{476,1,0,NULL,0,1,0,0},//12#空调开停机控制
		{479,3,0,NULL,0,1,0,0},//12#空调预留
		{487,8,0,NULL,0,1,0,0},//12#空调室内温度设定值
		{495,8,0,NULL,0,1,0,0},//12#空调室内实际温度值
		
		{503,8,0,NULL,0,1,0,0},//13#空调设备IP地址的高位
		{511,8,0,NULL,0,1,0,0},//13#空调设备IP地址的低位
		{515,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//13#空调工作模式
		{516,1,0,NULL,0,1,0,0},//13#空调开停机控制
		{519,3,0,NULL,0,1,0,0},//13#空调预留
		{527,8,0,NULL,0,1,0,0},//13#空调室内温度设定值
		{535,8,0,NULL,0,1,0,0},//13#空调室内实际温度值
		
		{543,8,0,NULL,0,1,0,0},//14#空调设备IP地址的高位
		{551,8,0,NULL,0,1,0,0},//14#空调设备IP地址的低位
		{555,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//14#空调工作模式
		{556,1,0,NULL,0,1,0,0},//14#空调开停机控制
		{559,3,0,NULL,0,1,0,0},//14#空调预留
		{567,8,0,NULL,0,1,0,0},//14#空调室内温度设定值
		{575,8,0,NULL,0,1,0,0},//14#空调室内实际温度值
		
		{583,8,0,NULL,0,1,0,0},//15#空调设备IP地址的高位
		{591,8,0,NULL,0,1,0,0},//15#空调设备IP地址的低位
		{595,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//15#空调工作模式
		{596,1,0,NULL,0,1,0,0},//15#空调开停机控制
		{599,3,0,NULL,0,1,0,0},//15#空调预留
		{607,8,0,NULL,0,1,0,0},//15#空调室内温度设定值
		{615,8,0,NULL,0,1,0,0},//15#空调室内实际温度值
		
		{623,8,0,NULL,0,1,0,0},//16#空调设备IP地址的高位
		{631,8,0,NULL,0,1,0,0},//16#空调设备IP地址的低位
		{635,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//16#空调工作模式
		{636,1,0,NULL,0,1,0,0},//16#空调开停机控制
		{639,3,0,NULL,0,1,0,0},//16#空调预留
		{647,8,0,NULL,0,1,0,0},//16#空调室内温度设定值
		{655,8,0,NULL,0,1,0,0},//16#空调室内实际温度值
	}
};



XM_Command xm_KTZD={//空调状态
	1,
	185,
	0,
	XM_KT_STATUS_LEN,
	0,
	0,
	0,
	102,
	0,
	0,
	0,
	{
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{7,8,sizeof(xm_FLR2value)/sizeof(xm_FLR2value[0]),xm_FLR2value,0,1,0,0},//风量	0
		{14,7,sizeof(xm_SM2value)/sizeof(xm_SM2value[0]),xm_SM2value,0,1,0,0},//睡眠	1
		{19,4,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,1,0,0},//模式	2
		{20,1,0,NULL,0,1,0,0},//开机	3
		{22,1,0,NULL,0,1,0,0},//风向	4
		{31,8,0,NULL,0,1,0,0},//温度	5
		{55,8,0,NULL,0,1,0,0},//湿度	6
		{71,8,0,NULL,0,1,0,0},//体感室内温度	7
		{39,8,0,NULL,0,1,0,0},//室内实际温度	8
		{47,8,0,NULL,0,1,0,0},//室内盘管温度	9
		{63,8,0,NULL,0,1,0,0},//室内实际湿度值	10
		{76,5,0,NULL,0,1,0,0},//体感室内温度补偿	11
		{78,1,0,NULL,0,1,0,0},//体感控制	12
		{83,4,0,NULL,0,1,0,0},//自动工作模式和除湿模式的温度补偿	13
		{86,1,0,NULL,0,1,0,0},//华氏/摄氏温度显示设置	14
		{94,6,sizeof(xm_GTT2value)/sizeof(xm_GTT2value[0]),xm_GTT2value,0,1,0,0},//普通定时开关机	15
		{100,5,0,NULL,0,1,0,0},//实时时钟的小时值	16
		{109,6,0,NULL,0,1,0,0},//实时时钟的分钟值	17
		{118,1,0,NULL,0,1,0,0},//实时开机控制	18
		{116,5,0,NULL,0,1,0,0},//实时开机小时	19
		{125,6,0,NULL,0,1,0,0},//实时开机分钟	20
		{134,1,0,NULL,0,1,0,0},//实时关机控制	21
		{132,5,0,NULL,0,1,0,0},//实时关机小时	22
		{141,6,0,NULL,0,1,0,0},//实时关机分钟	23
		{146,3,sizeof(xm_CS2value)/sizeof(xm_CS2value[0]),xm_CS2value,0,1,0,0},//除湿模式	24
		{150,3,sizeof(xm_VFM2value)/sizeof(xm_VFM2value[0]),xm_VFM2value,0,1,0,0},//上下风门	25
		{152,1,0,NULL,0,1,0,0},//上下风开停控制	26
		{153,1,0,NULL,0,1,0,0},//左右风开停控制	27
		{154,1,0,NULL,0,1,0,0},//自然风开停控制	28
		{155,1,0,NULL,0,1,0,0},//电热	29
		{156,1,0,NULL,0,1,0,0},//节能	30
		{157,1,0,NULL,0,1,0,0},//并用节电	31
		{158,1,0,NULL,0,1,0,0},//高效	32
		{159,1,0,NULL,0,1,0,0},//双模	33
		{160,1,0,NULL,0,1,0,0},//清新	34
		{161,1,0,NULL,0,1,0,0},//换风	35
		{162,1,0,NULL,0,1,0,0},//室内清洁	36
		{163,1,0,NULL,0,1,0,0},//室外清洁	37
		{164,1,0,NULL,0,1,0,0},//智慧眼	38
		{165,1,0,NULL,0,1,0,0},//静音	39
		{166,1,0,NULL,0,1,0,0},//语音	40
		{167,1,0,NULL,0,1,0,0},//除烟	41
		{168,1,0,NULL,0,1,0,0},//背景灯	42
		{169,1,0,NULL,0,1,0,0},//显示屏发光	43
		{170,1,0,NULL,0,1,0,0},//LED指示灯	44
		{171,1,0,NULL,0,1,0,0},//室内外温度切换显示	45
		{172,1,0,NULL,0,1,0,0},//室内过滤网清洁复位控制	46
		{173,1,0,NULL,0,1,0,0},//左风摆	47
		{174,1,0,NULL,0,1,0,0},//右风摆	48
		{175,1,0,NULL,0,1,0,0},//室内电量板	49
		{180,1,0,NULL,0,1,0,0},//本次命令之前是否有过红外遥控与按键控制过	50
		{181,1,0,NULL,0,1,0,0},//本次命令之前是否有过WIFI控制过	51
		{182,1,0,NULL,0,1,0,0},//空调正常机型与测试机型	52
		{183,1,0,NULL,0,1,0,0},//室内EEPROM在线升级	53
		{184,1,0,NULL,0,1,0,0},//室内温度传感器故障	54
		{185,1,0,NULL,0,1,0,0},//室内盘管温度传感器故障	55
		{186,1,0,NULL,0,1,0,0},//室内湿度传感器故障	56
		{187,1,0,NULL,0,1,0,0},//室内排水泵故障	57
		{188,1,0,NULL,0,1,0,0},//室内风机电机运转异常故障	58
		{189,1,0,NULL,0,1,0,0},//柜机格栅保护告警	59
		{190,1,0,NULL,0,1,0,0},//室内电压过零检测故障	60
		{191,1,0,NULL,0,1,0,0},//室内外通信故障	61
		{192,1,0,NULL,0,1,0,0},//室内控制板与显示板通信故障	62
		{193,1,0,NULL,0,1,0,0},//室内控制板与按键板通信故障	63
		{194,1,0,NULL,0,1,0,0},//WIFI控制板与室内控制板通信故障	64
		{195,1,0,NULL,0,1,0,0},//室内控制板与室内电量板通信故障	65
		{196,1,0,NULL,0,1,0,0},//室内控制板EEPROM出错	66
		{207,8,0,NULL,0,1,0,0},//运行频率	67
		{215,8,0,NULL,0,1,0,0},//目标频率	68
		{223,8,0,NULL,0,1,0,0},//发给驱动器的频率	69
		{231,8,0,NULL,0,1,0,0},//室外环境温度	70
		{239,8,0,NULL,0,1,0,0},//冷凝器温度	71
		{247,8,0,NULL,0,1,0,0},//排气温度	72
		{255,8,0,NULL,0,1,0,0},//目标排气温度	73
		{263,8,0,NULL,0,1,0,0},//室外电子膨胀阀开度	74
		{271,8,0,NULL,0,1,0,0},//UABH	75
		{279,8,0,NULL,0,1,0,0},//UABL	76
		{287,8,0,NULL,0,1,0,0},//UBCH	77
		{295,8,0,NULL,0,1,0,0},//UBCL	78
		{303,8,0,NULL,0,1,0,0},//UCAH	79
		{311,8,0,NULL,0,1,0,0},//UCAL	80
		{319,8,0,NULL,0,1,0,0},//IAB	81
		{327,8,0,NULL,0,1,0,0},//IBC	82
		{335,8,0,NULL,0,1,0,0},//ICA	83
		{359,8,0,NULL,0,1,0,0},//IUV	84
		{343,8,0,NULL,0,1,0,0},//直流母线电压H	85
		{351,8,0,NULL,0,1,0,0},//直流母线电压L	86
		{363,1,0,NULL,0,1,0,0},//四通阀状态	87
		{364,1,0,NULL,0,1,0,0},//室外机实际工作状态	88
		{367,3,0,NULL,0,1,0,0},//风机运行状态	89
		{368,1,0,NULL,0,1,0,0},//室外机强制室内机风门位置	90
		{369,1,0,NULL,0,1,0,0},//室外机强制室内机风速	91
		{370,1,0,NULL,0,1,0,0},//室外机强制室内机停	92
		{371,1,0,NULL,0,1,0,0},//温控关机	93
		{372,1,0,NULL,0,1,0,0},//一拖多标志	94
		{373,1,0,NULL,0,1,0,0},//除湿阀标志	95
		{374,1,0,NULL,0,1,0,0},//室外机化霜	96
		{375,1,0,NULL,0,1,0,0},//室外旁通化霜	97
		{376,1,0,NULL,0,1,0,0},//回油标志	98
		{377,1,0,NULL,0,1,0,0},//室外故障显示标志	99
		{378,1,0,NULL,0,1,0,0},//室外机EEPROM在线下载标志	100
		{379,1,0,NULL,0,1,0,0},//室外机电量板	101
		{380,1,0,NULL,0,1,0,0},//压缩机电热带	102
		{381,1,0,NULL,0,1,0,0},//压缩机预加热	103
		{382,1,0,NULL,0,1,0,0},//补气增晗	104
		{384,1,0,NULL,0,1,0,0},//室内外机模式冲突	105
		{385,1,0,NULL,0,1,0,0},//室外EEPROM出错	106
		{386,1,0,NULL,0,1,0,0},//室外盘管温度传感器故障	107
		{387,1,0,NULL,0,1,0,0},//排气温度传感器故障	108
		{388,1,0,NULL,0,1,0,0},//室外环境温度传感器故障	109
		{389,1,0,NULL,0,1,0,0},//电压变压器故障	110
		{390,1,0,NULL,0,1,0,0},//电流互感器故障	111
		{391,1,0,NULL,0,1,0,0},//室外控制与驱动通信故障	112
		{392,1,0,NULL,0,1,0,0},//IPM模块过流保护	113
		{393,1,0,NULL,0,1,0,0},//IPM模块过热保护	114
		{394,1,0,NULL,0,1,0,0},//交流电过电压保护	115
		{395,1,0,NULL,0,1,0,0},//交流电欠电压保护	116
		{396,1,0,NULL,0,1,0,0},//母线电压过电压保护	117
		{397,1,0,NULL,0,1,0,0},//母线电压欠电压保护	118
		{398,1,0,NULL,0,1,0,0},//PFC过电流保护	119
		{399,1,0,NULL,0,1,0,0},//室外机最大电流保护	120
		{400,1,0,NULL,0,1,0,0},//室外环境温度过低保护	121
		{401,1,0,NULL,0,1,0,0},//排气温度过高保护	122
		{402,1,0,NULL,0,1,0,0},//压缩机管壳温度保护	123
		{403,1,0,NULL,0,1,0,0},//室内防冻结或防过载保护	124
		{404,1,0,NULL,0,1,0,0},//室外机PFC保护	125
		{405,1,0,NULL,0,1,0,0},//压缩机启动失败	126
		{406,1,0,NULL,0,1,0,0},//压缩机失步	127
		{407,1,0,NULL,0,1,0,0},//室外风机堵转	128
		{408,1,0,NULL,0,1,0,0},//室外盘管防过载保护	129
		{409,1,0,NULL,0,1,0,0},//冷媒泄漏	130
		{410,1,0,NULL,0,1,0,0},//压缩机型号匹配错误	131
		{411,1,0,NULL,0,1,0,0},//系统低频振动保护	132
		{412,1,0,NULL,0,1,0,0},//室外散热器温度过高保护	133
		{413,1,0,NULL,0,1,0,0},//系统压力过高保护	134
		{416,1,0,NULL,0,1,0,0},//逆变器直流过电压故障	135
		{417,1,0,NULL,0,1,0,0},//逆变器直流低电压故障	136
		{418,1,0,NULL,0,1,0,0},//逆变器交流过电流故障	137
		{419,1,0,NULL,0,1,0,0},//失步检出	138
		{420,1,0,NULL,0,1,0,0},//速度推定脉冲检出法检出欠相故障	139
		{421,1,0,NULL,0,1,0,0},//电流推定脉冲检出法检出欠相故障	140
		{422,1,0,NULL,0,1,0,0},//逆变器IPM故障-边沿	141
		{423,1,0,NULL,0,1,0,0},//逆变器IPM故障-电平	142
		{424,1,0,NULL,0,1,0,0},//PFC_IPM故障-边沿	143
		{425,1,0,NULL,0,1,0,0},//PFC_IPM故障-电平	144
		{426,1,0,NULL,0,1,0,0},//PFC停电检出故障	145
		{427,1,0,NULL,0,1,0,0},//PFC过电流检出故障	146
		{428,1,0,NULL,0,1,0,0},//直流电压检出异常	147
		{429,1,0,NULL,0,1,0,0},//PFC低电压（有效值）检出故障	148
		{430,1,0,NULL,0,1,0,0},//AD偏置异常检出故障	149
		{431,1,0,NULL,0,1,0,0},//逆变器PWM逻辑设置故障	150
		{432,1,0,NULL,0,1,0,0},//逆变器PWM初始化故障	151
		{433,1,0,NULL,0,1,0,0},//PFC_PWM逻辑设置故障	152
		{434,1,0,NULL,0,1,0,0},//PFC_PWM初始化故障	153
		{435,1,0,NULL,0,1,0,0},//温度异常	154
		{436,1,0,NULL,0,1,0,0},//电流采样电阻不平衡调整故障	155
		{437,1,0,NULL,0,1,0,0},//电机参数设置故障	156
		{438,1,0,NULL,0,1,0,0},//MCE故障	157
		{439,1,0,NULL,0,1,0,0},//驱动EEPROM故障	158
		{440,1,0,NULL,0,1,0,0},//室外盘管过载禁升频	159
		{441,1,0,NULL,0,1,0,0},//室外盘管过载降频	160
		{442,1,0,NULL,0,1,0,0},//室内盘管过载禁升频	161
		{443,1,0,NULL,0,1,0,0},//室内盘管过载降频	162
		{444,1,0,NULL,0,1,0,0},//压降排气过载禁升频	163
		{445,1,0,NULL,0,1,0,0},//压降排气过载降频	164
		{446,1,0,NULL,0,1,0,0},//室内盘管冻结禁升频	165
		{447,1,0,NULL,0,1,0,0},//室内盘管冻结降频	166
		{448,1,0,NULL,0,1,0,0},//室内外通信降频	167
		{449,1,0,NULL,0,1,0,0},//模块温度过载限频	168
		{450,1,0,NULL,0,1,0,0},//变调率限频	169
		{451,1,0,NULL,0,1,0,0},//相电流限频	170
		{452,1,0,NULL,0,1,0,0},//并用节电保护禁升频	171
		{453,1,0,NULL,0,1,0,0},//并用节电保护降频	172
		{454,1,0,NULL,0,1,0,0},//过电流保护禁升频	173
		{455,1,0,NULL,0,1,0,0},//过电流保护降频	174
		{463,8,0,NULL,0,1,0,0},//室内风机转速xx	175
		{471,8,0,NULL,0,1,0,0},//室内风机转速00xx	176
		{472,1,0,NULL,0,1,0,0},//有否PM2.5检测功能	177
		{479,4,0,NULL,0,1,0,0},//PM2.5污染程度	178
		{487,8,0,NULL,0,1,0,0},//空气PM2.5质量百分比表示	179
		{494,7,0,NULL,0,1,0,0},//显示屏亮度值	180		
		{88,1,0,NULL,0,1,0,0},//普通定时开关机有效	181
		/**Ver 02.15*/
		{199,1,0,NULL,0,1,0,0},//VOC是否有效	182
		{179,4,0,NULL,0,1,0,0},//VOC 等级183
		{495,1,0,NULL,0,1,0,0},//8度制热184
	}
};



XM_Command xm_KTSBOX={//smartbox；一条命令操作多个功能；
	16,
	0,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	0,
	0,
	0,
	0,
	{
		{20,1,0,NULL,0,0,1,0},//开机
		{21,1,0,NULL,0,0,1,1},
		{18,3,sizeof(xm_mode2value)/sizeof(xm_mode2value[0]),xm_mode2value,0,0,1,0},//模式
		{19,1,0,NULL,0,0,1,1},
		{6,7,sizeof(xm_FL2value)/sizeof(xm_FL2value[0]),xm_FL2value,0,0,1,0},	//风量	
		{7,1,0,NULL,0,0,1,1},
		{30,7,0,NULL,0,0,1,0},//温度
		{31,1,0,NULL,0,0,1,1},
		{154,1,0,NULL,0,0,1,0},//静音模式
		{155,1,0,NULL,0,0,1,1},
		{126,3,0,NULL,0,0,1,0},	//设置风门位置
		{127,1,0,NULL,0,0,1,1},
		{140,1,0,NULL,0,0,1,0},	//强力功能设置
		{141,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{		
	}
};

XM_Command xm_ACENERGY={
	0,
	20,
	0,
	18,
	XM_KT_SUPPORT_LEN,
	102,
	48,
	102,
	48,
	0,
	0,
	{
	},
	{
		{7,8,0,NULL,0,1,0,0},//本次开停机使用的电量（kWh）整数位
		{11,4,0,NULL,0,1,0,0},//第一位小数
		{15,4,0,NULL,0,1,0,0},//第二位小数
		{19,4,0,NULL,0,1,0,0},//第三位小数
		{23,4,0,NULL,0,1,0,0},//第四位小数
		{31,8,0,NULL,0,1,0,0},//当天使用的电量（kWh）
		{39,8,0,NULL,0,1,0,0},//本周使用电量高位
		{47,8,0,NULL,0,1,0,0},//本周使用电量低位
		{55,8,0,NULL,0,1,0,0},//本月使用电量高位
		{63,8,0,NULL,0,1,0,0},//本月使用电量低位				
		{71,8,0,NULL,0,1,0,0},//本季度使用电量高位
		{79,8,0,NULL,0,1,0,0},//本季度使用电量低位									
		{87,8,0,NULL,0,1,0,0},//本半年使用电量高位
		{95,8,0,NULL,0,1,0,0},//本半年使用电量低位									
		{103,8,0,NULL,0,1,0,0},//本年使用电量高位
		{111,8,0,NULL,0,1,0,0},//本年使用电量低位	
		{119,8,0,NULL,0,1,0,0},//总使用量第4字节
		{127,8,0,NULL,0,1,0,0},//总使用量第3字节
		{135,8,0,NULL,0,1,0,0},//总使用量第2字节
		{143,8,0,NULL,0,1,0,0},//总使用量第1字节
	}
};


XM_Command xm_ACSETEx={
	10,
	7,
	10,
	10,
	0,
	101,
	1,
	102,
	1,
	0,
	0,
	{
		{54,1,0,NULL,0,0,1,0},//前景灯控制位
		{ 7,8,0,NULL,0,0,1,0},//前景为亮度 红
		{15,8,0,NULL,0,0,1,0},//前景为亮度 绿
		{23,8,0,NULL,0,0,1,0},//前景为亮度 蓝
		{55,1,0,NULL,0,0,1,0},//后景灯控制位
		{31,8,0,NULL,0,0,1,0},//后景为亮度 红
		{39,8,0,NULL,0,0,1,0},//后景为亮度 绿
		{47,8,0,NULL,0,0,1,0},//后景为亮度 蓝
		
		{58,1,0,NULL,0,0,1,0},//风向跟随控制
		{57,2,0,NULL,0,0,1,0},// 0 ，普通风向，1 跟随人，2，避人
	},
	{
		{ 7,8,0,NULL,0,1,0,0},//前景为亮度 红
		{15,8,0,NULL,0,1,0,0},//前景为亮度 绿
		{23,8,0,NULL,0,1,0,0},//前景为亮度 蓝
		{31,8,0,NULL,0,1,0,0},//后景为亮度 红
		{39,8,0,NULL,0,1,0,0},//后景为亮度 绿
		{47,8,0,NULL,0,1,0,0},//后景为亮度 蓝
		
		{57,2,0,NULL,0,1,0,0},// 0 ，普通风向，1 跟随人，2，避人
	}
};

XM_Command xm_ACQueryEx={
	0,
	7,
	0,
	10,
	0,
	102,
	1,
	102,
	1,
	0,
	0,
	{
	},
	{
		{ 7,8,0,NULL,0,1,0,0},//前景为亮度 红
		{15,8,0,NULL,0,1,0,0},//前景为亮度 绿
		{23,8,0,NULL,0,1,0,0},//前景为亮度 蓝
		{31,8,0,NULL,0,1,0,0},//后景为亮度 红
		{39,8,0,NULL,0,1,0,0},//后景为亮度 绿
		{47,8,0,NULL,0,1,0,0},//后景为亮度 蓝
		
		{57,2,0,NULL,0,1,0,0},// 0 ，普通风向，1 跟随人，2，避人
	}
};

XM_Command xm_AC8HEAT={//8度制热
	4,
	4,
	XM_KT_SET_LEN,
	XM_KT_STATUS_LEN,
	XM_KT_SUPPORT_LEN,
	101,
	0,
	102,
	0,
	102,
	64,
	{
		{174,1,0,NULL,0,0,1,0},
		{175,1,0,NULL,0,0,1,1},
		{61,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,1,0,0}
	},
	{

	}
};


XM_AT_RET at_cmd_ret_kt[6]={
		{"KTZD",XM_SEND_QUERY,102,0,&xm_KTZD},
		{"KTMULTIZD",XM_SEND_QUERY,202,0,&xm_KTMULTIZD},
		{"KTGN",XM_SEND_QUERY,102,64,&xm_KTGN},
		{"KTSET",XM_SEND_QUERY,101,0,&xm_KTZD},
		{"ACSETex",XM_SEND_QUERY,101,1,&xm_ACQueryEx},
		{"ACQueryex",XM_SEND_QUERY,102,1,&xm_ACQueryEx},
};

XM_AT_FUN at_cmd_kt[59]={			
		{"KTFL",NULL,0,&xm_KTFL},//设置风量 -待验证
		{"KTSM",NULL,0,&xm_KTSM},//睡眠 -待验证
		{"KTYX",NULL,0,&xm_KTYX},//模式 -待验证
		{"KTKJ",NULL,0,&xm_KTKJ},//开机 -待验证
		{"KTFX",NULL,0,&xm_KTFX},//风向 -待验证
		{"KTWD",NULL,0,&xm_KTWD},//温度 -待验证
		{"KTSD",NULL,0,&xm_KTSD},//湿度 -待验证
		{"KTTGWD",NULL,0,&xm_KTTGWD},//体感室内温度 -待验证
		{"KTTGBC",NULL,0,&xm_KTTGBC},//体感室内温度补偿 -待验证
		{"KTTGCZ",NULL,0,&xm_KTTGCZ},//体感控制 -待验证
		{"KTWDBC",NULL,0,&xm_KTWDBC},//自动工作模式和除湿模式的温度补偿 -待验证
		{"KTHS",NULL,0,&xm_KTHS},//华氏/摄氏温度显示设置 -待验证
		{"KTGTT",NULL,0,&xm_KTGTT},//普通定时开关机 -待验证
		{"KTSSH",NULL,0,&xm_KTSSH},//实时时钟的小时值 -待验证
		{"KTSSM",NULL,0,&xm_KTSSM},//实时时钟的分钟值 -待验证	
		{"KTKT",NULL,0,&xm_KTKT},//实时开机控制 -待验证		
		{"KTGT",NULL,0,&xm_KTGT},//实时关机控制 -待验证
		{"KTCS",NULL,0,&xm_KTCS},//除湿模式 -待验证
		{"KTVFM",NULL,0,&xm_KTVFM},//上下风门 -待验证
		{"KTVFC",NULL,0,&xm_KTVFC},//上下风开停控制 -待验证
		{"KTHFC",NULL,0,&xm_KTHFC},//左右风开停控制 -待验证
		{"KTZRF",NULL,0,&xm_KTZRF},//自然风开停控制 -待验证
		{"KTDR",NULL,0,&xm_KTDR},//电热 -待验证
		{"KTJN",NULL,0,&xm_KTJN},//节能 -待验证
		{"KTBY",NULL,0,&xm_KTBY},//并用节电 -待验证
		{"KTGX",NULL,0,&xm_KTGX},//高效 -待验证
		{"KTGXex",NULL,0,&xm_KTGXex},//高效 -待验证
		{"KTDM",NULL,0,&xm_KTDM},//双模 -待验证
		{"KTJH",NULL,0,&xm_KTJH},//清新 -待验证
		{"KTHF",NULL,0,&xm_KTHF},//换风 -待验证
		{"KTQJ",NULL,0,&xm_KTQJ},//室内清洁 -待验证
		{"KTSWQJ",NULL,0,&xm_KTSWQJ},//室外清洁 -待验证
		{"KTZN",NULL,0,&xm_KTZN},//智慧眼 -待验证
		{"KTJY",NULL,0,&xm_KTJY},//静音 -待验证
		{"KTYY",NULL,0,&xm_KTYY},//语音 -待验证
		{"KTCY",NULL,0,&xm_KTCY},//除烟 -待验证
		{"KTBJD",NULL,0,&xm_KTBJD},//背景灯 -待验证
		{"KTXSP",NULL,0,&xm_KTXSP},//显示屏发光 -待验证
		{"KTLED",NULL,0,&xm_KTLED},//LED指示灯 -待验证
		{"KTSRW",NULL,0,&xm_KTSRW},//室内外温度切换显示 -待验证
		{"KTGLW",NULL,0,&xm_KTGLW},//室内过滤网清洁复位控制 -待验证
		{"KTZFB",NULL,0,&xm_KTZFB},//左风摆 -待验证
		{"KTYFB",NULL,0,&xm_KTYFB},//右风摆 -待验证
		{"KTLD",NULL,0,&xm_KTLD},//显示屏亮度值-待验证
		{"KTXYM",NULL,0,&xm_KTXYM},//设备信息码命令-待验证
		{"KTDQEFD",NULL,0,&xm_KTDQEFD},//读取家电（第1）控制器的EEPROM全体数据命令
		{"KTDQSEFD",NULL,0,&xm_KTDQSEFD},//读取家电（第1）控制器全体程序数据命令
		{"KTDQZEFD",NULL,0,&xm_KTDQZEFD},//读取所需设备指定控制器的全体密钥数据命令	
		{"KTZD",NULL,0,&xm_KTZD},//空调状态查询；返回当前空调的所有状态
		{"KTGN",NULL,0,&xm_KTGN},//空调功能查询；返回当前空调支持的功能列表
		{"KTSS",NULL,0,&xm_KTSS},//实时时钟待验证
		{"KTVF",NULL,0,&xm_KTVF},//上下风控制 -待验证
		{"KTHFM",NULL,0,&xm_KTHFM},//左右风开停 -待验证
		{"KTSBOX",NULL,0,&xm_KTSBOX},//smartbox；一条命令操作多个功能；
		{"KTMULTIZD",NULL,0,&xm_KTMULTIZD},//多个空调状态；
		{"ACENERGY",NULL,0,&xm_ACENERGY},
		/* Ver 02.15*/
		{"ACSETex",NULL,0,&xm_ACSETEx},
		{"ACQueryex",NULL,0,&xm_ACQueryEx},
		{"AC8PwrSvr",NULL,0,&xm_AC8HEAT},
		
};

