#include	"xm_type.h"
/*  8合一传感器 设备地址 0x53*/


XM_Command sensor_pm2_5={// PM2.5操作
	2,
	0,
	3,
	0,
	0,
	101,
	0,
	102,
	0,
	0,
	0,
	{
		{6,1,0,NULL,0,0,1,0},
		{7,1,0,NULL,0,0,1,1},	
	},
	{
	},
};


XM_Command sensor_Power={// 传感器电源设置
	3,
	0,
	3,
	0,
	0,
	101,
	0,
	102,
	0,
	0,
	0,
	{
		{14,1,0,NULL,0,0,1,0},/*打开还是关闭*/
		{15,1,0,NULL,0,0,1,1},	
		{23,8,0,NULL,0,0,1,0},	/*打开还是关闭 255表示操作所有senser*/
	},
	{
	},
};

XM_Command sensor_Report={// 设备状态
	2,
	0,
	3,
	0,
	0,
	101,
	0,
	102,
	0,
	0,
	0,
	{
		{31,8,0,NULL,0,0,1,0}, //上报的ID
		{39,8,0,NULL,0,0,1,0}, //上报的频率高
		{47,8,0,NULL,0,0,1,0}, // 上报的频率低
	},
	{
	},
};



XM_Command Query_senser={// 传感器状态
	1,
	35,
	3,
	0,
	0,
	101,
	0,
	102,
	0,
	0,
	0,
	{
		{7,1,0,NULL,0,1,0,0}, //SetFlag
	},
	{
		{7,8,0,NULL,0,1,0,0}, // 温度ID
		{14,1,0,NULL,0,1,0,0}, // 温度值有效位
		{15,1,0,NULL,0,1,0,0}, // 温度传感器是否上电
		{23,8,0,NULL,0,1,0,0}, // 温度值读值时间间隔高
		{31,8,0,NULL,0,1,0,0}, // 温度值读值时间间隔低
		{39,8,0,NULL,0,1,0,0}, // 温度值高
		{47,8,0,NULL,0,1,0,0}, // 温度值低

		{55,8,0,NULL,0,1,0,0}, // 湿度ID
		{62,1,0,NULL,0,1,0,0}, // 湿度值有效位
		{63,1,0,NULL,0,1,0,0}, // 湿度传感器上电标志
		{71,8,0,NULL,0,1,0,0}, // 湿度值读值时间间隔高
		{79,8,0,NULL,0,1,0,0}, // 湿度值读值时间间隔低
		{95,8,0,NULL,0,1,0,0}, // 湿度值

		{103,8,0,NULL,0,1,0,0}, // 甲醛ID
		{110,1,0,NULL,0,1,0,0}, // 甲醛值有效位
		{111,1,0,NULL,0,1,0,0}, // 甲醛传感器是否上电
		{119,8,0,NULL,0,1,0,0}, // 甲醛值读值时间间隔高
		{127,8,0,NULL,0,1,0,0}, // 甲醛值读值时间间隔低
		{135,8,0,NULL,0,1,0,0}, // 温度值高
		{143,8,0,NULL,0,1,0,0}, // 温度值低	

		{151,8,0,NULL,0,1,0,0}, // PM2.5 ID
		{158,1,0,NULL,0,1,0,0}, //PM2.5 值有效位
		{159,1,0,NULL,0,1,0,0}, // PM2.5 传感器是否上电
		{167,8,0,NULL,0,1,0,0}, // PM2.5 值读值时间间隔高
		{175,8,0,NULL,0,1,0,0}, // PM2.5 值读值时间间隔低
		{183,8,0,NULL,0,1,0,0}, // PM2.5 值高
		{191,8,0,NULL,0,1,0,0}, // PM2.5 值低	


		{199,8,0,NULL,0,1,0,0}, //CO2 ID
		{206,1,0,NULL,0,1,0,0}, //CO2 值有效位
		{207,1,0,NULL,0,1,0,0}, // CO2 传感器是否上电
		{215,8,0,NULL,0,1,0,0}, // CO2 值读值时间间隔高
		{223,8,0,NULL,0,1,0,0}, // CO2 值读值时间间隔低
		{231,8,0,NULL,0,1,0,0}, // CO2 值高
		{239,8,0,NULL,0,1,0,0}, // CO2 值低	

		{351,1,0,NULL,0,1,0,0}, // 与外设通讯故障

	},
};


XM_AT_FUN at_cmd_senser[4]={
	{"SensorQuery",NULL,0,&Query_senser},
	{"Pm2_5Ctl",NULL,0,&sensor_pm2_5},
	{"sensorPwr",NULL,0,&sensor_Power},
	{"sensorReport",NULL,0,&sensor_Report},	
};

XM_AT_RET at_cmd_ret_senser[2]={
	{"SensorQuery",XM_SEND_QUERY,102,0,&Query_senser},
	{"SensorSet",XM_SEND_SETTING,101,0,NULL}		
};	

