/*
 * Copyright 2009-2011 Cedric Priscal
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#include	"xmlog.h"
#include	"xm_type.h"
#include	"message.h"
#include	"hisense.h"
#include	"cmdanalysis.h"

#define XM_OVEN_SET_LEN 16
#define XM_OVEN_STATUS_LEN 30

XM_Command xm_OVFP={//oven fan power ·ç»ú¿ª¹Ø
	7,
	0,
	XM_OVEN_SET_LEN,
	0,
	0,
	101,
	0,
	0,
	0,
	0,
	0,
 	{	
 		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24
 		{15,8,0,NULL,0,0,1,0}, // uID 23-16
		{23,8,0,NULL,0,0,1,0}, // uID 15-8
		{31,8,0,NULL,0,0,1,0}, // uID 7-0
		{38,7,0,NULL,0,0,1,0},
		{39,1,0,NULL,0,0,1,1},
		{111,1,0,NULL,0,0,1,0}
	},
	{		
	}
};




XM_Command xm_OVRF={//oven rotary fork ×ª²æ¿ª¹Ø
	7,
	0,
	XM_OVEN_SET_LEN,
	0,
	0,
	101,
	0,
	0,
	0,
	0,
	0,
	{	{7 ,8,0,NULL,0,0,1,0}, // uID 31-24
 		{15,8,0,NULL,0,0,1,0}, // uID 23-16
		{23,8,0,NULL,0,0,1,0}, // uID 15-8
		{31,8,0,NULL,0,0,1,0}, // uID 7-0	
		{46,7,0,NULL,0,0,1,0},
		{47,1,0,NULL,0,0,1,1},
		{111,1,0,NULL,0,0,1,0}
	},
	{		
	}
};

XM_Command xm_OVLAMP={//oven lamp Â¯µÆ¿ª¹Ø
	7,
	0,
	XM_OVEN_SET_LEN,
	0,
	0,
	101,
	0,
	0,
	0,
	0,
	0,
	{	
		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24
 		{15,8,0,NULL,0,0,1,0}, // uID 23-16
		{23,8,0,NULL,0,0,1,0}, // uID 15-8
		{31,8,0,NULL,0,0,1,0}, // uID 7-0
		{54,7,0,NULL,0,0,1,0},
		{55,1,0,NULL,0,0,1,1},
		{111,1,0,NULL,0,0,1,0}
	},
	{		
	}
};

XM_Command xm_OVUDT={//oven up and down temperature ÉÏÖÐÏÂ¹ÜÎÂ¶ÈÉèÖÃ
	12,
	0,
	XM_OVEN_SET_LEN,
	0,
	0,
	101,
	0,
	0,
	0,
	0,
	0,
	{	
		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24
 		{15,8,0,NULL,0,0,1,0}, // uID 23-16
		{23,8,0,NULL,0,0,1,0}, // uID 15-8
		{31,8,0,NULL,0,0,1,0}, // uID 7-0
		{63,8,0,NULL,0,0,1,0}, // up high
		{71,8,0,NULL,0,0,1,0}, // up low
		{79,8,0,NULL,0,0,1,0}, // middle high
		{87,8,0,NULL,0,0,1,0}, // middle low
		{95,8,0,NULL,0,0,1,0}, // down high
		{103,8,0,NULL,0,0,1,0}, // down low
		{110,1,0,NULL,0,0,1,1},
		{111,1,0,NULL,0,0,1,0}
	},
	{		
	}
};

XM_Command xm_OVSQ={//oven status query ×´Ì¬²éÑ¯
	1,
	57,
	1,
	XM_OVEN_STATUS_LEN,
	0,
	0,
	0,
	102,
	0,
	0,
	0,
	{		
		{7,1,0,NULL,0,1,0,0}
	},
	{		
		{7 ,8,0,NULL,0,1,0,0}, // uID 31-24    0
 		{15,8,0,NULL,0,1,0,0}, // uID 23-16    1
		{23,8,0,NULL,0,1,0,0}, // uID 15-8     2
		{31,8,0,NULL,0,1,0,0}, // uID 7-0      3
		{35,1,0,NULL,0,1,0,0},//Ô¤ÈÈ×´Ì¬4
		{36,1,0,NULL,0,1,0,0},//Õû»ú¿ª¹Ø×´Ì¬5
		{37,1,0,NULL,0,1,0,0},//Â¯µÆ¿ª¹Ø×´Ì¬6
		{38,1,0,NULL,0,1,0,0},//×ª²æ¿ª¹Ø×´Ì¬7
		{39,1,0,NULL,0,1,0,0},//·ç»ú¿ª¹Ø×´Ì¬8
		{47,8,0,NULL,0,1,0,0},//ÕýÔÚºæ±ºÇúÏß£¬µ±ÎÞÇúÏßºæ±ºÊ±£¬´ËÖµÎª0xff  9
		{55,8,0,NULL,0,1,0,0},//ÒÑÍê³Éºæ±ºÊ±¼ä£¬¸ßÎ»10
		{63,8,0,NULL,0,1,0,0},//ÒÑÍê³Éºæ±ºÊ±¼ä£¬µÍÎ»11
		{71,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÉÏ¹ÜÎÂ¶È,¸ßÎ»12
		{79,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÉÏ¹ÜÎÂ¶È,µÍÎ»13
		{87,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÖÐ¹ÜÎÂ¶È,¸ßÎ»14
		{95,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÖÐ¹ÜÎÂ¶È,µÍÎ»15
		{103,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÏÂ¹ÜÎÂ¶È,¸ßÎ»16
		{111,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÏÂ¹ÜÎÂ¶È,µÍÎ»17
		{119,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÉÏ¹ÜÎÂ¶È,¸ßÎ»18
		{127,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÉÏ¹ÜÎÂ¶È,µÍÎ»19
		{135,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÖÐ¹ÜÎÂ¶È,¸ßÎ»20
		{143,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÖÐ¹ÜÎÂ¶È,µÍÎ»21
		{151,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÏÂ¹ÜÎÂ¶È,¸ßÎ»22
		{159,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÏÂ¹ÜÎÂ¶È,µÍÎ»23
		{167,8,0,NULL,0,1,0,0},//µ±Ç°ÉÏ¹Ü¹¦ÂÊ(0~100,±íÊ¾0~100%) 24
		{175,8,0,NULL,0,1,0,0},//µ±Ç°ÖÐ¹Ü¹¦ÂÊ(0~100,±íÊ¾0~100%) 25
		{183,8,0,NULL,0,1,0,0},//µ±Ç°ÏÂ¹Ü¹¦ÂÊ(0~100,±íÊ¾0~100%) 26
		{191,3,0,NULL,0,1,0,0},//¿¾Ïä×´Ì¬27
		{195,1,0,NULL,0,1,0,0},//ÎÂ¶ÈÉèÖÃ´íÎó28
		{196,1,0,NULL,0,1,0,0},//´æ´¢Éè±¸¹ÊÕÏ29
		{197,1,0,NULL,0,1,0,0},//¿¾Ïä·¢ÈÈ¹ÊÕÏ30
		{198,1,0,NULL,0,1,0,0},//ÎÂ¶È´«¸ÐÆ÷´íÎó31
		{199,1,0,NULL,0,1,0,0},//I2CÉè±¸´íÎó	32
		{207,1,0,NULL,0,1,0,0},//211-0ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü33
		{203,1,0,NULL,0,1,0,0},//211-0ÃüÁî²Ëµ¥Ãû³Æ´íÎó34
		{204,1,0,NULL,0,1,0,0},//211-0ÃüÁî×ÜÉÕ¿¾Ê±¼ä´íÎó35
		{205,1,0,NULL,0,1,0,0},//211-0ÃüÁîÇúÏß¸öÊý´íÎó36
		{206,1,0,NULL,0,1,0,0},//211-0ÃüÁî²Ëµ¥ÇúÏß´íÎó37
		{215,1,0,NULL,0,1,0,0},//211-2ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü38
		{209,1,0,NULL,0,1,0,0},//211-2ÃüÁîÉèÖÃÊ±¼ä´íÎó39
		{210,1,0,NULL,0,1,0,0},//211-2ÃüÁîÉÏÖÐÏÂ¹ÜÎÂ¶ÈÉèÖÃ´íÎó40
		{211,1,0,NULL,0,1,0,0},//211-2ÃüÁî·ç»úÉèÖÃ´íÎó41
		{212,1,0,NULL,0,1,0,0},//211-2ÃüÁî×ª²æÉèÖÃ´íÎó42
		{213,1,0,NULL,0,1,0,0},//211-2ÃüÁîÇúÏß×Ó½Úµã¹ý¶à43
		{214,1,0,NULL,0,1,0,0},//211-2ÃüÁî²Ëµ¥ÇúÏß´íÎó44
		{223,1,0,NULL,0,1,0,0},//211-3ÃüÁîÖ´ÐÐ½á¹û:ÍêÕûor ²»ÍêÕû45
		{222,1,0,NULL,0,1,0,0},//211-4ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü46
		{218,1,0,NULL,0,1,0,0},//211-4ÃüÁîÇúÏß´íÎó47
		{219,1,0,NULL,0,1,0,0},//211-4ÃüÁî¸ÃÇúÏß²»´æÔÚ48
		{220,1,0,NULL,0,1,0,0},//211-4ÃüÁî¿¾ÏäÎ´¿ª»ú49
		{221,1,0,NULL,0,1,0,0},//211-4ÃüÁî¿¾ÏäÕý¹¤×÷ÔÚºæ±º³ÌÐòÖÐ50
		{217,1,0,NULL,0,1,0,0},//211-5ÃüÁîÖ´ÐÐ½á¹û:ÇúÏßÊÇ·ñ´íÎó-³É¹¦or Ê§°Ü51
		{216,1,0,NULL,0,1,0,0},//211-7ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü52
		{228,1,0,NULL,0,1,0,0},//211-7 ÇúÏß´æÔÚ53
		{227,1,0,NULL,0,1,0,0},//211-7 ÇúÏß×Ó½Úµã²»´æÔÚ54
		{226,1,0,NULL,0,1,0,0},//211-8 ÃüÁîÇúÏß²»´æÔÚ55
		{225,1,0,NULL,0,1,0,0},//211-9¿¾ÏäÎ´¹¤×÷ÔÚºæ±ºÄ£Ê½56
	}
};


XM_Command xm_OVFQ={//oven function query ¹¦ÄÜ²éÑ¯
	1,
	7,
	1,
	8,
	0,
	0,
	0,
	102,
	64,
	0,
	0,
	{
		{7,1,0,NULL,0,1,0,0}
	},
	{
		{7,8,0,NULL,0,1,0,0},//¼ÓÈÈ¹Ü¹¦ÄÜ
		{15,1,0,NULL,0,1,0,0},//Â¯µÆ¹¦ÄÜ
		{23,1,0,NULL,0,1,0,0},//×ª²æ¹¦ÄÜ
		{31,1,0,NULL,0,1,0,0},//ÈÈ·çÑ­»·¹¦ÄÜ
		{39,8,0,NULL,0,1,0,0},//µÍÎÂ·¢½Í¹¦ÄÜ
		{47,8,0,NULL,0,1,0,0},//½â¶³¹¦ÄÜ
		{63,8,0,NULL,0,1,0,0},//±¨¾¯¹¦ÄÜ
	}
};

XM_Command xm_OVSMN={//oven set menu name ÉèÖÃ²Ëµ¥Ãû×Ö
	10,
	0,
	72,
	0,
	0,
	211,
	0,
	0,
	0,
	0,
	0,
	{	
		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24    0
 		{15,8,0,NULL,0,0,1,0}, // uID 23-16    1
		{23,8,0,NULL,0,0,1,0}, // uID 15-8     2
		{31,8,0,NULL,0,0,1,0}, // uID 7-0      3
		{35,4,0,NULL,0,0,1,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥£©
		{47,8,0,NULL,0,0,1,0},//ÎÂ¶ÈÇúÏß¸öÊý
		{55,8,0,NULL,0,0,1,0},//×ÜÉÕ¿¾Ê±¼ä£¬¸ßÎ»
		{63,8,0,NULL,0,0,1,0},//×ÜÉÕ¿¾Ê±¼ä£¬µÍÎ»
		{575,512,0,NULL,0,0,1,0},//²Ëµ¥Ãû×Ö--- 64¸ö×Ö·û
		{39,1,0,NULL,0,0,1,0}//ÊÖ¶¯»ò×Ô¶¯
	},
	{		
	}
};

XM_Command xm_OVSMTEx={//oven set menu temprature extend ÉèÖÃ²Ëµ¥ÎÂ¶ÈÀ©Õ¹ÃüÁî
	25,
	0,
	16,
	0,
	0,
	211,
	2,
	0,
	0,
	0,
	0,
	{
	 {7 ,8,0,NULL,0,0,1,0}, // uID 31-24    0
  	 {15,8,0,NULL,0,0,1,0}, // uID 23-16    1
	 {23,8,0,NULL,0,0,1,0}, // uID 15-8     2
	 {31,8,0,NULL,0,0,1,0}, // uID 7-0      3
	 {35,4,0,NULL,0,0,1,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
	 {47,8,0,NULL,0,0,1,0},//ÇúÏß×Ó½Úµã
	 {55,8,0,NULL,0,0,1,0},//Ê±¼ä£¬¸ßÎ»
	 {63,8,0,NULL,0,0,1,0},//Ê±¼ä£¬µÍÎ»
	 {71,8,0,NULL,0,0,1,0},//ÉÏ¹ÜÎÂ¶ÈÖµ£º¸ßÎ»	    
	 {79,8,0,NULL,0,0,1,0},//ÉÏ¹ÜÎÂ¶ÈÖµ£ºµÍÎ»
	 {87,8,0,NULL,0,0,1,0},//ÖÐ¹ÜÎÂ¶ÈÖµ£º¸ßÎ»	    
	 {95,8,0,NULL,0,0,1,0},//ÖÐ¹ÜÎÂ¶ÈÖµ£ºµÍÎ»
	 {103,8,0,NULL,0,0,1,0},//ÏÂ¹ÜÎÂ¶ÈÖµ£º¸ßÎ»	    
	 {111,8,0,NULL,0,0,1,0},//ÏÂ¹ÜÎÂ¶ÈÖµ£ºµÍÎ»
	 {117,8,0,NULL,0,0,1,0},//×ª²æ¿ª¹Ø
	 {118,8,0,NULL,0,0,1,0},//·ç»ú¿ª¹Ø
	 {119,8,0,NULL,0,0,1,0},//ÌáÐÑÔÝÍ£
	 {120,1,0,NULL,0,0,1,0},//Ê±¼äÊÇ·ñÐèÉèÖÃ
	 {121,1,0,NULL,0,0,1,0},//ÉÏ¹ÜÎÂ¶ÈÊÇ·ñÐèÉèÖÃ
	 {122,1,0,NULL,0,0,1,0},//ÖÐ¹ÜÎÂ¶ÈÊÇ·ñÐèÉèÖÃ
	 {123,1,0,NULL,0,0,1,0},//ÏÂ¹ÜÎÂ¶ÈÊÇ·ñÐèÉèÖÃ
	 {124,1,0,NULL,0,0,1,0},//×ª²æ¿ª¹ØÊÇ·ñÐèÉèÖÃ
	 {125,1,0,NULL,0,0,1,0},//·ç»ú¿ª¹ØÊÇ·ñÐèÉèÖÃ
	 {126,1,0,NULL,0,0,1,0},//ÌáÐÑÔÝÍ£ÊÇ·ñÐèÉèÖÃ	 
	 {39,1,0,NULL,0,0,1,0},//ÊÖ¶¯»ò×Ô¶¯
	},
	{		
	}
};

XM_Command xm_OVCIC={//oven curve integrity checkÇúÏßÍêÕûÐÔ¼ì²éÓ¦´ð
	6,
	0,
	5,
	0,
	0,
	211,
	3,
	0,
	0,
	0,
	0,
	{	
	 {7 ,8,0,NULL,0,0,1,0}, // uID 31-24    0
 	 {15,8,0,NULL,0,0,1,0}, // uID 23-16    1
	 {23,8,0,NULL,0,0,1,0}, // uID 15-8     2
	 {31,8,0,NULL,0,0,1,0}, // uID 7-0      3
	 {35,4,0,NULL,0,0,1,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
	 {39,1,0,NULL,0,0,1,0},//ÊÖ¶¯»ò×Ô¶¯
	},
	{		
	}
};

XM_Command xm_OVCEC={//oven curve excute command 	ÇúÏßÖ´ÐÐÃüÁî
	6,
	0,
	5,
	0,
	0,
	211,
	4,
	0,
	0,
	0,
	0,
	{	
		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24    0
		{15,8,0,NULL,0,0,1,0}, // uID 23-16    1
		{23,8,0,NULL,0,0,1,0}, // uID 15-8	   2
		{31,8,0,NULL,0,0,1,0}, // uID 7-0	   3
		{35,4,0,NULL,0,0,1,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
		{39,1,0,NULL,0,0,1,0},//ÊÖ¶¯»ò×Ô¶¯
	},
	{		
	}
};

XM_Command xm_OVGMN={//oven get menu name »ñÈ¡²Ëµ¥Ãû×Ö
	2,
	5,
	2,
	68,
	0,
	0,
	0,
	211,
	5,
	0,
	0,
	{	
		{7,8,0,NULL,0,1,0,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2,3£¨¹²4¸ö²Ëµ¥,3ÎªÓÃ»§×îºóÉÕ¿¾Ê¹ÓÃ£©
		{15,1,0,NULL,0,1,0,0},//ÊÖ¶¯»ò×Ô¶¯
	},
	{	
		{7,8,0,NULL,0,1,0,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2,3
		{15,8,0,NULL,0,1,0,0},//ÎÂ¶ÈÇúÏß¸öÊý
		{23,8,0,NULL,0,1,0,0},//×ÜÉÕ¿¾Ê±¼ä£¬¸ßÎ»
		{31,8,0,NULL,0,1,0,0},//×ÜÉÕ¿¾Ê±¼ä£¬µÍÎ»
		{543,512,0,NULL,0,1,0,0},//²Ëµ¥Ãû×Ö--- 64¸ö×Ö·û		
	}
};

XM_Command xm_OVGTCEx={//oven get temprature curve extend»ñÈ¡ÎÂ¶ÈÇúÏßÀ©Õ¹ÃüÁî
	3,
	20,
	2,
	12,
	0,
	0,
	0,
	211,
	7,
	0,
	0,
	{
	 {3,4,0,NULL,0,1,0,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
	 {15,8,0,NULL,0,1,0,0},//ÇúÏß×Ó½Úµã
	 {7,1,0,NULL,0,1,0,0},//ÊÖ¶¯»ò×Ô¶¯
	},
	{		
	 {7,8,0,NULL,0,1,0,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
	 {15,8,0,NULL,0,1,0,0},//ÇúÏß×Ó½Úµã
	 {23,8,0,NULL,0,1,0,0},//Ê±¼ä£¬¸ßÎ»
	 {31,8,0,NULL,0,1,0,0},//Ê±¼ä£¬µÍÎ»
	 {39,8,0,NULL,0,1,0,0},//ÉÏ¹ÜÎÂ¶ÈÖµ£º¸ßÎ»	    
	 {47,8,0,NULL,0,1,0,0},//ÉÏ¹ÜÎÂ¶ÈÖµ£ºµÍÎ»
	 {55,8,0,NULL,0,1,0,0},//ÖÐ¹ÜÎÂ¶ÈÖµ£º¸ßÎ»	    
	 {63,8,0,NULL,0,1,0,0},//ÖÐ¹ÜÎÂ¶ÈÖµ£ºµÍÎ»
	 {71,8,0,NULL,0,1,0,0},//ÏÂ¹ÜÎÂ¶ÈÖµ£º¸ßÎ»	    
	 {79,8,0,NULL,0,1,0,0},//ÏÂ¹ÜÎÂ¶ÈÖµ£ºµÍÎ»
	 {85,8,0,NULL,0,1,0,0},//×ª²æ¿ª¹Ø
	 {86,8,0,NULL,0,1,0,0},//·ç»ú¿ª¹Ø
	 {87,8,0,NULL,0,1,0,0},//ÌáÐÑÔÝÍ£
	 {88,1,0,NULL,0,1,0,0},//Ê±¼äÊÇ·ñÐèÉèÖÃ
	 {89,1,0,NULL,0,1,0,0},//ÉÏ¹ÜÎÂ¶ÈÊÇ·ñÐèÉèÖÃ
	 {90,1,0,NULL,0,1,0,0},//ÖÐ¹ÜÎÂ¶ÈÊÇ·ñÐèÉèÖÃ
	 {91,1,0,NULL,0,1,0,0},//ÏÂ¹ÜÎÂ¶ÈÊÇ·ñÐèÉèÖÃ
	 {92,1,0,NULL,0,1,0,0},//×ª²æ¿ª¹ØÊÇ·ñÐèÉèÖÃ
	 {93,1,0,NULL,0,1,0,0},//·ç»ú¿ª¹ØÊÇ·ñÐèÉèÖÃ
	 {94,1,0,NULL,0,1,0,0},//ÌáÐÑÔÝÍ£ÊÇ·ñÐèÉèÖÃ		
	}
};

XM_Command xm_OVCCE={//oven curve cancel command	ÇúÏßÈ¡ÏûÖ´ÐÐÃüÁî
	6,
	0,
	5,
	0,
	0,
	211,
	8,
	0,
	0,
	0,
	0,
	{	
		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24    0
		{15,8,0,NULL,0,0,1,0}, // uID 23-16    1
		{23,8,0,NULL,0,0,1,0}, // uID 15-8	   2
		{31,8,0,NULL,0,0,1,0}, // uID 7-0	   3
		{35,4,0,NULL,0,0,1,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
		{39,1,0,NULL,0,0,1,0},//ÊÖ¶¯»ò×Ô¶¯

	},
	{		
	}
};

XM_Command xm_OVPCC={//oven curve pause or continue commandÇúÏßÔÝÍ£-¼ÌÐø²Ù×÷ÃüÁî
	7,
	0,
	5,
	0,
	0,
	211,
	9,
	0,
	0,
	0,
	0,
	{
		{7 ,8,0,NULL,0,0,1,0}, // uID 31-24    0
		{15,8,0,NULL,0,0,1,0}, // uID 23-16    1
		{23,8,0,NULL,0,0,1,0}, // uID 15-8	   2
		{31,8,0,NULL,0,0,1,0}, // uID 7-0	   3
	 	{35,4,0,NULL,0,0,1,0},//²ËÆ×±àºÅ£º¿ÉÄÜÖµÎª0,1,2£¨¹²Èý¸ö²Ëµ¥)
	 	{38,1,0,NULL,0,0,1,0},//ÔÝÍ£»ò¼ÌÐøÖ´ÐÐÎÂ¶ÈÇúÏß
	 	{39,1,0,NULL,0,0,1,0},//ÊÖ¶¯»ò×Ô¶¯
	},
	{		
	}
};

XM_Command xm_OVPRODUCT={//²úÆ·ÐÍºÅ¶ÁÈ¡ÓëÐ´Èë
	4,
	4,
	26,
	26,
	0,
	103,
	0,
	103,
	1,
	0,
	0,
	{
		{7,8,0,NULL,0,0,1,0},//µÚÒ»¸ö×Ö½Ú´ú±íÊý¾ÝÀàÐÍ0±íÊ¾Ê¹ÓÃBCD±àÂë£¬
		{191,184,0,NULL,0,0,1,0},//ºóÐø23¸ö×Ö½Ú±íÊ¾Êý¾Ý£¬
		{199,8,0,NULL,0,0,1,0},//ºó2×Ö½ÚÎªÀÛ¼ÓºÍ
		{207,8,0,NULL,0,0,1,0},//ºó2×Ö½ÚÎªÀÛ¼ÓºÍ
	},
	{
		{7,8,0,NULL,0,1,0,0},//µÚÒ»¸ö×Ö½Ú´ú±íÊý¾ÝÀàÐÍ0±íÊ¾Ê¹ÓÃBCD±àÂë£¬
		{191,184,0,NULL,0,1,0,0},//ºóÐø23¸ö×Ö½Ú±íÊ¾Êý¾Ý£¬
		{199,8,0,NULL,0,1,0,0},//ºó2×Ö½ÚÎªÀÛ¼ÓºÍ
		{207,8,0,NULL,0,1,0,0},//ºó2×Ö½ÚÎªÀÛ¼ÓºÍ
	}
};


XM_Command xm_OVREP={//oven report ²éÑ¯Ö÷¶¯ÉÏ±¨ÐÅÏ¢
	1,
	58,
	1,
	93,
	0,
	102,
	8,
	102,
	8,
	0,
	0,
	{		
		{7,1,0,NULL,0,1,0,0}
	},
	{		
		{7 ,8,0,NULL,0,1,0,0}, // uID 31-24    0
 		{15,8,0,NULL,0,1,0,0}, // uID 23-16    1
		{23,8,0,NULL,0,1,0,0}, // uID 15-8     2
		{31,8,0,NULL,0,1,0,0}, // uID 7-0      3
		{35,1,0,NULL,0,1,0,0},//Ô¤ÈÈ×´Ì¬4
		{36,1,0,NULL,0,1,0,0},//Õû»ú¿ª¹Ø×´Ì¬5
		{37,1,0,NULL,0,1,0,0},//Â¯µÆ¿ª¹Ø×´Ì¬6
		{38,1,0,NULL,0,1,0,0},//×ª²æ¿ª¹Ø×´Ì¬7
		{39,1,0,NULL,0,1,0,0},//·ç»ú¿ª¹Ø×´Ì¬8
		{47,8,0,NULL,0,1,0,0},//ÕýÔÚºæ±ºÇúÏß£¬µ±ÎÞÇúÏßºæ±ºÊ±£¬´ËÖµÎª0xff  9
		{55,8,0,NULL,0,1,0,0},//ÒÑÍê³Éºæ±ºÊ±¼ä£¬¸ßÎ»10
		{63,8,0,NULL,0,1,0,0},//ÒÑÍê³Éºæ±ºÊ±¼ä£¬µÍÎ»11
		{71,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÉÏ¹ÜÎÂ¶È,¸ßÎ»12
		{79,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÉÏ¹ÜÎÂ¶È,µÍÎ»13
		{87,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÖÐ¹ÜÎÂ¶È,¸ßÎ»14
		{95,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÖÐ¹ÜÎÂ¶È,µÍÎ»15
		{103,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÏÂ¹ÜÎÂ¶È,¸ßÎ»16
		{111,8,0,NULL,0,1,0,0},//µ±Ç°ÉèÖÃµÄÏÂ¹ÜÎÂ¶È,µÍÎ»17
		{119,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÉÏ¹ÜÎÂ¶È,¸ßÎ»18
		{127,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÉÏ¹ÜÎÂ¶È,µÍÎ»19
		{135,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÖÐ¹ÜÎÂ¶È,¸ßÎ»20
		{143,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÖÐ¹ÜÎÂ¶È,µÍÎ»21
		{151,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÏÂ¹ÜÎÂ¶È,¸ßÎ»22
		{159,8,0,NULL,0,1,0,0},//µ±Ç°Êµ¼ÊµÄÏÂ¹ÜÎÂ¶È,µÍÎ»23
		{167,8,0,NULL,0,1,0,0},//µ±Ç°ÉÏ¹Ü¹¦ÂÊ(0~100,±íÊ¾0~100%) 24
		{175,8,0,NULL,0,1,0,0},//µ±Ç°ÖÐ¹Ü¹¦ÂÊ(0~100,±íÊ¾0~100%) 25
		{183,8,0,NULL,0,1,0,0},//µ±Ç°ÏÂ¹Ü¹¦ÂÊ(0~100,±íÊ¾0~100%) 26
		{191,3,0,NULL,0,1,0,0},//¿¾Ïä×´Ì¬27
		{195,1,0,NULL,0,1,0,0},//ÎÂ¶ÈÉèÖÃ´íÎó28
		{196,1,0,NULL,0,1,0,0},//´æ´¢Éè±¸¹ÊÕÏ29
		{197,1,0,NULL,0,1,0,0},//¿¾Ïä·¢ÈÈ¹ÊÕÏ30
		{198,1,0,NULL,0,1,0,0},//ÎÂ¶È´«¸ÐÆ÷´íÎó31
		{199,1,0,NULL,0,1,0,0},//I2CÉè±¸´íÎó	32
		{207,1,0,NULL,0,1,0,0},//211-0ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü33
		{203,1,0,NULL,0,1,0,0},//211-0ÃüÁî²Ëµ¥Ãû³Æ´íÎó34
		{204,1,0,NULL,0,1,0,0},//211-0ÃüÁî×ÜÉÕ¿¾Ê±¼ä´íÎó35
		{205,1,0,NULL,0,1,0,0},//211-0ÃüÁîÇúÏß¸öÊý´íÎó36
		{206,1,0,NULL,0,1,0,0},//211-0ÃüÁî²Ëµ¥ÇúÏß´íÎó37
		{215,1,0,NULL,0,1,0,0},//211-2ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü38
		{209,1,0,NULL,0,1,0,0},//211-2ÃüÁîÉèÖÃÊ±¼ä´íÎó39
		{210,1,0,NULL,0,1,0,0},//211-2ÃüÁîÉÏÖÐÏÂ¹ÜÎÂ¶ÈÉèÖÃ´íÎó40
		{211,1,0,NULL,0,1,0,0},//211-2ÃüÁî·ç»úÉèÖÃ´íÎó41
		{212,1,0,NULL,0,1,0,0},//211-2ÃüÁî×ª²æÉèÖÃ´íÎó42
		{213,1,0,NULL,0,1,0,0},//211-2ÃüÁîÇúÏß×Ó½Úµã¹ý¶à43
		{214,1,0,NULL,0,1,0,0},//211-2ÃüÁî²Ëµ¥ÇúÏß´íÎó44
		{223,1,0,NULL,0,1,0,0},//211-3ÃüÁîÖ´ÐÐ½á¹û:ÍêÕûor ²»ÍêÕû45
		{222,1,0,NULL,0,1,0,0},//211-4ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü46
		{218,1,0,NULL,0,1,0,0},//211-4ÃüÁîÇúÏß´íÎó47
		{219,1,0,NULL,0,1,0,0},//211-4ÃüÁî¸ÃÇúÏß²»´æÔÚ48
		{220,1,0,NULL,0,1,0,0},//211-4ÃüÁî¿¾ÏäÎ´¿ª»ú49
		{221,1,0,NULL,0,1,0,0},//211-4ÃüÁî¿¾ÏäÕý¹¤×÷ÔÚºæ±º³ÌÐòÖÐ50
		{217,1,0,NULL,0,1,0,0},//211-5ÃüÁîÖ´ÐÐ½á¹û:ÇúÏßÊÇ·ñ´íÎó-³É¹¦or Ê§°Ü51
		{216,1,0,NULL,0,1,0,0},//211-7ÃüÁîÖ´ÐÐ½á¹û:³É¹¦or Ê§°Ü52
		{228,1,0,NULL,0,1,0,0},//211-7 ÇúÏß´æÔÚ53
		{227,1,0,NULL,0,1,0,0},//211-7 ÇúÏß×Ó½Úµã²»´æÔÚ54
		{226,1,0,NULL,0,1,0,0},//211-8 ÃüÁîÇúÏß²»´æÔÚ55
		{225,1,0,NULL,0,1,0,0},//211-9¿¾ÏäÎ´¹¤×÷ÔÚºæ±ºÄ£Ê½56
		{743,512,0,NULL,0,1,0,0},//ÇúÏßIDºÍ²ËÆ×IDºÅ
	}
};

XM_Command xm_DEVOTASTR={//oven otaÉý¼¶µÚÒ»Ö¡Êý¾Ý
	1,
	0,
	132,
	0,
	0,
	1,
	0,
	1,
	0,
	0,
	0,

	{
	 	{0xff,132,0,NULL,0,0,1,0},// ÄÚÈÝ
	},
	{	
	}
};


XM_Command xm_DEVOTA={//oven otaÉý¼¶Êý¾Ý°ü
	5,
	0,
	132,
	0,
	0,
	1,
	0,
	1,
	0,
	0,
	0,
 	{

		{7 ,8,0,NULL,0,0,1,0}, //Ê²Ã´ÃüÁî
		{15,8,0,NULL,0,0,1,0}, // ¸ÃÃüÁîµÄ·´Âë
		{23,8,0,NULL,0,0,1,0}, // ÄÚ²¿MCU±àºÅ
		{31,8,0,NULL,0,0,1,0}, // ±àºÅµÄ·´Âë
	 	{1055,128*8,0,NULL,0,0,1,0},// Êý¾ÝÄÚÈÝ
 	},
 	{		
 	}
 };


XM_AT_RET at_cmd_ret_oven[13]={
		{"OVSQ",XM_SEND_QUERY,102,0,&xm_OVSQ},
		{"OVFQ",XM_SEND_QUERY,102,64,&xm_OVFQ},		
		{"OVSMN",XM_SEND_SETTING,211,0,&xm_OVSMN},
		{"OVSMTEx",XM_SEND_SETTING,211,2,&xm_OVSMTEx},
		{"OVCIC",XM_SEND_SETTING,211,3,&xm_OVCIC},
		{"OVCEC",XM_SEND_SETTING,211,4,&xm_OVCEC},
		{"OVGMN",XM_SEND_QUERY,211,5,&xm_OVGMN},
		{"OVGTCEx",XM_SEND_QUERY,211,7,&xm_OVGTCEx},
		{"OVCCE",XM_SEND_SETTING,211,8,&xm_OVCCE},
		{"OVPCC",XM_SEND_SETTING,211,9,&xm_OVPCC},
		{"OVSET",XM_SEND_SETTING,101,0,NULL},
		{"OVREP",XM_SEND_QUERY,102,8,&xm_OVREP},
		{"DEVOTA",XM_SEND_QUERY,1,0,&xm_DEVOTA},
};

XM_AT_FUN at_cmd_oven[18]={
	{"OVFP",NULL,0,&xm_OVFP},//oven fan power ·ç»ú¿ª¹Ø
	{"OVRF",NULL,0,&xm_OVRF},//oven rotary fork ×ª²æ¿ª¹Ø
	{"OVLAMP",NULL,0,&xm_OVLAMP},//oven lamp Â¯µÆ¿ª¹Ø
	{"OVUDT",NULL,0,&xm_OVUDT},//oven up and down temperature ÉÏÏÂ¹ÜÎÂ¶ÈÉèÖÃ
	{"OVSQ",NULL,0,&xm_OVSQ},//oven status query ×´Ì¬²éÑ¯
	{"OVFQ",NULL,0,&xm_OVFQ},//oven function query ¹¦ÄÜ²éÑ¯
	{"OVSMN",NULL,0,&xm_OVSMN},//oven set menu name ÉèÖÃ²Ëµ¥Ãû×Ö
	{"OVSMTEx",NULL,0,&xm_OVSMTEx},//oven set menu temprature extend ÉèÖÃ²Ëµ¥ÎÂ¶ÈÀ©Õ¹ÃüÁî	
	{"OVGMN",NULL,0,&xm_OVGMN},//oven get menu name »ñÈ¡²Ëµ¥Ãû×Ö
	{"OVGTCEx",NULL,0,&xm_OVGTCEx},//oven get temprature curve extend»ñÈ¡ÎÂ¶ÈÇúÏßÀ©Õ¹ÃüÁ
	{"OVCIC",NULL,0,&xm_OVCIC},//oven curve integrity checkÇúÏßÍêÕûÐÔ¼ì²éÓ¦´ðî
	{"OVCEC",NULL,0,&xm_OVCEC},//oven curve excute command 	ÇúÏßÖ´ÐÐÃüÁî
	{"OVMRW",NULL,0,&xm_OVPRODUCT},//oven model read and write ²úÆ·ÐÍºÅ¶ÁÈ¡ÓëÐ´Èë
	{"OVCCE",NULL,0,&xm_OVCCE},//oven curve cancel command	ÇúÏßÈ¡ÏûÖ´ÐÐÃüÁî
	{"OVPCC",NULL,0,&xm_OVPCC},//oven curve pause or continue commandÇúÏßÔÝÍ£-¼ÌÐø²Ù×÷ÃüÁî
	{"OVREP",NULL,0,&xm_OVREP},//oven report Ö÷¶¯ÉÏ±¨ÃüÁî
	{"DEVOTA",NULL,0,&xm_DEVOTA},
	{"DEVOTASTART",NULL,0,&xm_DEVOTASTR},
};

